{
    "opentelemetry-nextjs": {
        "name": "OpenTelemetry NextJS Tutorial",
        "description": "Complete guide to implementing OpenTelemetry in Next.js applications",
        "longDescription": "<p>This comprehensive series transforms your Next.js application from a black box into a fully observable system using OpenTelemetry and SigNoz. Starting with basic instrumentation, you'll progress through real-world monitoring scenarios to production-ready observability.</p><p>Learn to track everything that matters: server-side traces and API performance, client-side Web Vitals and widget impact, structured logging with trace correlation, exception monitoring, and external API dependencies. You'll also master production concerns like sampling strategies, data sanitization, alerting, and scaling—whether deploying on Vercel or self-hosted infrastructure.</p><p>By the end, you'll have unified observability across your entire Next.js stack, from browser performance to backend bottlenecks, all visualized in SigNoz dashboards with actionable alerts.</p>",
        "seriesOverviewHref": "/opentelemetry/nextjs",
        "heroImageUrl": "/img/blog/2024/12/opentelemetry-nextjs-cover.webp",
        "keywords": [
            "OpenTelemetry",
            "NextJS",
            "Observability",
            "Tracing",
            "Metrics",
            "Logs",
            "SigNoz",
            "JavaScript",
            "Performance Monitoring"
        ],
        "articles": [
            {
                "title": "Monitor NextJS with OpenTelemetry - Traces, Metrics, and Logs",
                "description": "Learn how to instrument your Next.js application using OpenTelemetry to collect traces, metrics, and logs and send them to SigNoz for complete observability.",
                "href": "/blog/opentelemetry-nextjs",
                "learningOutcomes": [
                    "Set up OpenTelemetry instrumentation in Next.js with @vercel/otel",
                    "Configure automatic tracing for API routes, SSR, and fetch requests",
                    "Deploy and run an OpenTelemetry Collector locally with Docker",
                    "Export traces to both Jaeger and SigNoz for visualization",
                    "Understand default Next.js spans and trace analysis",
                    "Debug instrumentation issues and optimize trace collection"
                ]
            },
            {
                "title": "NextJS OpenTelemetry Use Cases - Monitoring 404s, External APIs, Exceptions & More",
                "description": "Explore powerful real-world observability patterns in your Next.js application using OpenTelemetry and SigNoz—from tracking 404s to monitoring third-party APIs.",
                "href": "/blog/opentelemetry-nextjs-use-cases",
                "learningOutcomes": [
                    "Build custom queries in SigNoz to track 404 errors and route issues",
                    "Monitor third-party API performance and external dependencies",
                    "Implement exception monitoring with proper span error recording",
                    "Create dashboards for business metrics and user journey tracking",
                    "Set up database query monitoring and slow query detection",
                    "Track cache hit/miss ratios and background job performance"
                ]
            },
            {
                "title": "Tracking Web Vitals & Widget Performance in Next.js with OpenTelemetry",
                "description": "Learn how to instrument your Next.js frontend to track Web Vitals and third-party widget performance using OpenTelemetry and send the data to SigNoz.",
                "href": "/blog/opentelemetry-nextjs-web-vitals",
                "learningOutcomes": [
                    "Instrument browser-side OpenTelemetry for frontend monitoring",
                    "Capture Core Web Vitals (LCP, INP, CLS) with real user data",
                    "Track third-party widget loading performance and impact",
                    "Export browser metrics to SigNoz via OTLP HTTP",
                    "Create Web Vitals dashboards for performance monitoring",
                    "Correlate frontend performance with backend traces"
                ]
            },
            {
                "title": "Structured Logging in NextJS with OpenTelemetry",
                "description": "Implement structured logging in your Next.js app using OpenTelemetry with full trace correlation and SigNoz integration for both server and browser logging.",
                "href": "/blog/opentelemetry-nextjs-logging",
                "learningOutcomes": [
                    "Set up structured logging with OpenTelemetry logs SDK",
                    "Implement server-side logging with automatic trace correlation",
                    "Build browser logger that exports to server via API routes",
                    "Correlate logs with traces using traceId and spanId",
                    "Create unified logging across client and server environments",
                    "Visualize correlated logs and traces in SigNoz dashboards"
                ]
            },
            {
                "title": "Deploying and Scaling OpenTelemetry in Production NextJS Apps",
                "description": "Learn how to deploy OpenTelemetry-instrumented Next.js apps to production with Vercel or self-hosted infra, covering collector vs direct exporter setups and best practices.",
                "href": "/blog/opentelemetry-nextjs-production",
                "learningOutcomes": [
                    "Deploy instrumented Next.js apps to Vercel and self-hosted infrastructure",
                    "Choose between OpenTelemetry Collector vs direct exporter architectures",
                    "Implement production-grade alerting for latency, errors, and external APIs",
                    "Configure sampling strategies to optimize performance and costs",
                    "Sanitize sensitive data and implement security best practices",
                    "Handle cold starts, performance overhead, and scaling considerations"
                ]
            }
        ]
    }
}